ERM/src/InformationRegisters/Collectors.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>Collectors</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Collector</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GeoMarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.HFM_Geomarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/Collectors/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	СписокКлиентов = ЭтотОбъект.ВыгрузитьКолонку("Client");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Collectors.ManagementGeomarket) КАК КоличествоЗаписейПоКлиенту,
		|	Collectors.Client,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА Collectors.ManagementGeomarket = ЗНАЧЕНИЕ(Справочник.ManagementGeography.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ЕстьПустойManagementGeomarket
		|ИЗ
		|	РегистрСведений.Collectors КАК Collectors
		|ГДЕ
		|	Collectors.Client В (&Clients)
		|СГРУППИРОВАТЬ ПО
		|	Collectors.Client";
	
	Запрос.УстановитьПараметр("Clients", СписокКлиентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.КоличествоЗаписейПоКлиенту > 1 И ВыборкаДетальныеЗаписи.ЕстьПустойManagementGeomarket Тогда
			Отказ = Истина;
			Сообщить("Error writing. Select Management Geomarket for each collector.");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
